# SelectedColor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorSelectionDialog..::..SelectedColor Property
ColorSelectionDialog Class See Also
---
The new color selected by the user.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public Color SelectedColor { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SelectedColor As Color
	Get
```

Visual C++
---
```text
public:
property Color^ SelectedColor {
	Color^ get ();
}
```

# See Also
ColorSelectionDialog Class
Autodesk.Revit.UI Namespace